
## Plan Result (demo)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.app_insight_viewers[0]
  * azurerm_role_assignment.app_insight_viewers_monitoring[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.app_insight_viewers[0] will be created
  + resource "azurerm_role_assignment" "app_insight_viewers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "/groups/6490ec76-a586-4736-a586-e35ca0a24967"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Insights Component Contributor"
      + scope                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-demo/loggers/sds-api-mgmt-demo-logger"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.app_insight_viewers_monitoring[0] will be created
  + resource "azurerm_role_assignment" "app_insight_viewers_monitoring" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "/groups/6490ec76-a586-4736-a586-e35ca0a24967"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Insights/components/sds-api-mgmt-demo"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":130,"Program":"tfcmt","SHA1":"","Target":"demo","Vars":{}} -->